def process_data(data):
    """处理文件"""


"""
大文件处理策略
"""

"""
=================================================================================================
第一种方式: 生成器
=================================================================================================
"""


def read_in_chunks(file_object, chunk_size=1024):
    """借助生成器函数，实现懒加载方式，逐块读取，默认1K"""
    while True:
        f = file_object.read(chunk_size)
        if not f:
            break
        yield f


with open('pathFile.txt') as f:
    for piece in read_in_chunks(f):
        process_data(piece)

# 使用 iter() 方法直接获取生成器
# 读取文件的句柄处理本身就是一个生成器

f = open('target.txt')


def read1K():
    return f.read(1024)


for piece in iter(read1K, ""):
    process_data(piece)

# 处理行文件
for line in open('target.txt'):
    process_data(line)

"""
=================================================================================================
第二种方式: iter() 内置函数
iter(object[, sentinel])
object：支持迭代的集合对象（可迭代对象）;
    - 当只传入object时，返回一个迭代器对象
sentinel： 如果传递了该参数，则object必须是一个可调用对象（如：函数）；
    - 返回一个迭代器，每次迭代都会调用object，直到object返回值等于 sentinel时，终止调用

l = [1,2,3,5,6]
for i in iter(l):
    print(i)
=================================================================================================
"""

"""
=================================================================================================
iter: 需要一个零参数的函数
    - f.read 由于缺少 size参数，将默认读取全部文件
    - f.read(1024) 将直接返回读取的文件内容，并不是函数
    - (lambda : f.read(1024)) 是一个零参数的匿名函数； 等效于 func = (lambda x: f.read(1024)) 
        - 外部的括号可以去掉，也可以正常运行
=================================================================================================
"""
chunk_size = 1024
with open('target.txt', 'rb') as f:  # rb 读取为二进制格式
    for chunk in iter((lambda: f.read(chunk_size)), b""):
        process_data(chunk)

"""
=================================================================================================
第三种方式: python3.8


f = open('./target.txt')
while piece:= f.read(chunk):
    process_data(piece)

除了易于读写之外，它还比使用iter的速度更快，因为在每次读取块时都避免了一次Python函数调用。
=================================================================================================
"""
