# !/usr/bin/env python
# -*-coding:utf-8 -*-
# Warning    ：The Hard Way Is Easier

"""
================================================================
a的值？
a = 1
try:
    a += 1
except:
    a += 1
else:
    a += 1
finally:
    a += 1
print(a)


a=3
"""

"""
================================================================
嵌套函数执行结果：
def bar(multiple):
    def foo(n):
        return multiple ** n

    return foo

A bar(2)(3) == 8
B bar(2)(3) == 6
C bar(3)(2) == 8
D bar(3)(2) == 6

A
"""

"""
================================================================
下列哪种不是Python元组的定义方式？：
A (1)
B (1, )
C (1, 2)
D (1, 2, (3, 4))

A： 执行结果等于无括号的1； 同理： ("benny") 
"""

"""
================================================================
下述字符串格式化语法正确的是？

A 'GNU's Not %d %%'  % 'UNIX'
B 'GNU\'s Not %d %%'  % 'UNIX'
C 'GNU's Not %s %%'   % 'UNIX'
D 'GNU\'s Not %s %%'  % 'UNIX'

D
"""

"""
================================================================
 如何解释下面的执行结果?
print( 1.2 - 1.0 == 0.2)
False

print( 0.2 == 0.2 )
?

A Python的实现有错误
B 浮点数无法精确表示
C 布尔运算不能用于浮点数比较
D Python将非0数视为False


"""
print(1.2 - 1.0 == 0.2)
print(0.2 == 0.2)

"""
================================================================
python my.py v1 v2 命令运行脚本，通过 from sys import argv如何获得v2的参数值?
A argv[0]
B argv[1]
C argv[2]
D argv[3]

C
argv[0]: 模块的完整路径； Linux中 $0 脚本名称
"""

"""
================================================================
下面代码的输出值：
l = [0,1,2,3,5,6]
print(l[20:])   # 非常容易错误

print(l[20])    # IndexError
"""

"""
================================================================
若 a = range(100)，以下哪些操作是合法的?
a[-3]
a[2:13]
a[::3]
a[2-3]

全都可以; a[2-3] => a[-1]
"""

"""
================================================================
counter = 1 
def doLotsOfStuff(): 
    global counter
    for i in (1, 2, 3): 
        counter += 1 
doLotsOfStuff()
print(counter)
"""


"""
================================================================
若 a = (1, 2, 3)，下列哪些操作是合法的?
a[1:-1]
a*3 # 复制三份同样内容
a[2] = 4
list(a)

元组不可修改
"""


"""
================================================================
已知a = [1, 2, 3]和b = [1, 2, 4]，那么id(a[1])==id(b[1])的执行结果 （）



python中对于小整数对象有一个小整数对象池，范围在[-5,257）之间。对于在这个范围内的征数，不会新建对象，直接从小整数对象池中取就行。
True
"""



"""
================================================================
关于Python内存管理，下列说法错误的是 
A 变量不必事先声明
B 变量无须先创建和赋值而直接使用
C 变量无须指定类型
D 可以使用del释放资源



# B 变量不需要创建，但需要先复制才能使用
del 删除引用计数，其实就是为了释放资源
"""


