# !/usr/bin/env python
# -*-coding:utf-8 -*-
# Warning    ：The Hard Way Is Easier


"""
在Python2中，下列哪种函式参数定义不合法?
def myfunc(*args):
def myfunc(arg1=1):
def myfunc(*args, a=1):
def myfunc(a=1, **args):

==> C

参考文章： https://blog.csdn.net/maoxuexue/article/details/105904906
------------------------------------------------------------------------------------

下列对协程的理解错误的是？
一个线程可以运行多个协程
协程的调度由所在程序自身控制
Linux中线程的调度由操作系统控制
Linux中协程的调度由操作系统控制

==》 D

------------------------------------------------------------------------------------
a与b定义如下，下列哪个是正确的？
a = '123'
b = '123'
A a != b
B a is b
C a == 123
D a + b = 246

==》 B

------------------------------------------------------------------------------------
下列哪种不是Python元组的定义方式？
A (1)
B (1, )
C (1, 2)
D (1, 2, (3, 4))

==> A

------------------------------------------------------------------------------------
下列代码运行结果是？
a = 'a'
print a > 'b' or 'c'

A a
B b
C c
D True
E False

------------------------------------------------------------------------------------
下列哪种类型是Python的映射类型？ ==》 dict

------------------------------------------------------------------------------------
如何解释下面的执行结果?
print 1.2 - 1.0 == 0.2
False

A Python的实现有错误
B 浮点数无法精确表示
C 布尔运算不能用于浮点数比较
D Python将非0数视为False

------------------------------------------------------------------------------------
 python my.py v1 v2 命令运行脚本，通过 from sys import argv如何获得v2的参数值?
A argv[0]
B argv[1]
C argv[2]
D argv[3]

------------------------------------------------------------------------------------
What gets printed?()
kvps = { '1' : 1, '2' : 2 }
theCopy = kvps.copy()
kvps['1'] = 5
sum = kvps['1'] + theCopy['1']
print sum

==》 6
"""

a = 'a'
print(a > 'b' or "c")
print(a < 'b' or "c")

# 小写字母的ASCII值大于大写
print(a > 'b')
print('A' < 'a')

# a-z递增
print("a" < "b" < "c")

kvps = {'1': 1, '2': 2, '3':[]}
theCopy = kvps.copy()   # 浅拷贝
theCopy['3'].append(3)

print(theCopy, kvps)



"""
================================================================
在Python 2.7中，下列哪种是Unicode编码的书写方式?
A a = ‘中文’
B a = r‘中文’
C a = u’中文’
D a = b’中文’

C
B:不转义
D:二进制
"""