# !/usr/bin/env python
# -*-coding:utf-8 -*-
# PROJECT    : Python-Exercise
# Time       ：2020/12/28 11:10
# Warning    ：The Hard Way Is Easier
import re

"""
====================================================================
re.split()： 先用正则匹配，然后用匹配到的元素分割
pattern: 匹配的正则，
string: 待分割对象
maxsplit=0: 分割次数，默认0，表示不限制次数，彻底分割
flags=0: 正则匹配模式 
====================================================================
"""
s = "benny, tom, benny, lisa"

# \W 非字母数字
# `, `
print(re.split(r"\W+", s))
print(re.split(r"(\W+)", s))

"""
====================================================================
re.findall()

====================================================================
"""

"""
====================================================================
re.compile()
re.match()
re.search()
====================================================================
"""

"""
====================================================================
re.sub()
将匹配到的内容，替换为repl内容
    pattern: 匹配模式
    repl：取代对象
    string： 待处理字符串
    counts： 匹配后，替换数量； 默认为0，全部替换
    flags： 模式
====================================================================
"""

a = "benny 100 100 100 100 100"
res = re.sub(r"\d{3,}", "80", a, count=2, )
print(res)
